src/InformationRegisters/ПланировкаРасписанияTEST/ПланировкаРасписанияTEST.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланировкаРасписанияTEST</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДеньНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Разрез</name>
    <type>
      <types>CatalogRef.РазрезДня</types>
    </type>
  </resources>
  <resources>
    <name>ДокументВыхода</name>
    <type>
      <types>DocumentRef.РАСПИСАНИЕ_Записавшиеся_TEST</types>
    </type>
  </resources>
  <attributes>
    <name>ШапкаОпроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСлужбы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяСлужбы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПланировкаРасписанияTEST/ManagerModule.bsl
Функция ПолучитьПредставлениеДляОпросаВТГ(ДокументРегистратор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланировкаРасписанияTEST.ДатаСлужбы КАК ДатаСлужбы,
		|	ПланировкаРасписанияTEST.ВремяСлужбы КАК ВремяСлужбы,
		|	ПланировкаРасписанияTEST.ДеньНедели КАК ДеньНедели,
		|	ПРЕДСТАВЛЕНИЕ(ПланировкаРасписанияTEST.Разрез) КАК Разрез
		|ИЗ
		|	РегистрСведений.ПланировкаРасписанияTEST КАК ПланировкаРасписанияTEST
		|ГДЕ
		|	ПланировкаРасписанияTEST.Регистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСлужбНедели = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ПредставлениеСлужбы = Серверный.ПолучитьПредставлениеСлужбы(Выборка.ДеньНедели, Выборка.Разрез, Выборка.ДатаСлужбы, Выборка.ВремяСлужбы);
		МассивСлужбНедели.Добавить(ПредставлениеСлужбы);
	КонецЦикла;
	
	Возврат МассивСлужбНедели;

КонецФункции // ПолучитьПредставлениеДляОпросаВТГ(ДокументРегистратор)    

Функция ПолучитьНачалоНеделиРасписания(ДокументРегистратор) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПланировкаРасписанияTEST.ДатаСлужбы КАК ДатаСлужбы       
		|ИЗ
		|	РегистрСведений.ПланировкаРасписанияTEST КАК ПланировкаРасписанияTEST
		|ГДЕ
		|	ПланировкаРасписанияTEST.Регистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачалоВыбираемойНедели = НачалоНедели(Выборка.ДатаСлужбы);
	КонецЦикла;
	
	Возврат НачалоВыбираемойНедели;
	
КонецФункции // ПолучитьНачалоНеделиРасписания(ДокументРегистратор)
